# IFCLink Orientation Enumeration

Source: https://www.revitapidocs.com/2026/95081cfc-ae14-6716-aa80-e65251ca2683.htm

---

| IFCLink Orientation Enumeration |
| --- |

IFC Link Orientation within the Host Document.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum IFCLinkOrientation
```

```
Public Enumeration IFCLinkOrientation
```

```
public enum class IFCLinkOrientation
```

```
type IFCLinkOrientation
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| ProjectNorth | 0 | Orient IFC File to Project North. |
| TrueNorth | 1 | Orient IFC File to True North. |

See Also

#### Reference

Autodesk.Revit.DB.IFC Namespace